Картриджи/src/Documents/СпросНаКартриджи/СпросНаКартриджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпросНаКартриджи</name>
  <registerRecords>InformationRegister.СпросКартриджей</registerRecords>
  <attributes>
    <name>Подазделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнен</name>
    <type>
      <types>EnumRef.ИсполнениеСпросов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Картриджи</name>
    <attributes>
      <name>МодельКартриджа</name>
      <type>
        <types>CatalogRef.МоделиКартриджей</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Картриджи/src/InformationRegisters/СпросКартриджей/СпросКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпросКартриджей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоИсполнено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МодельКартриджа</name>
    <type>
      <types>CatalogRef.МоделиКартриджей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Картриджи/src/Enums/ИсполнениеСпросов/ИсполнениеСпросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсполнениеСпросов</name>
  <enumValues>
    <name>НеВыполнено</name>
  </enumValues>
  <enumValues>
    <name>ВыполненоЧастично</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
</mdclass:Enum>

Картриджи/src/Documents/СпросНаКартриджи/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СпросКартриджей
	Движения.СпросКартриджей.Записывать = Истина;
	
	Для Каждого ТекСтрокаКартриджи Из Картриджи Цикл
		
		Движение = Движения.СпросКартриджей.Добавить();
		
		Движение.Период              = Дата;
		Движение.МодельКартриджа     = ТекСтрокаКартриджи.МодельКартриджа;
		Движение.Подразделение       = Подазделение;
		Движение.Количество          = ТекСтрокаКартриджи.Количество;
		Движение.КоличествоИсполнено = ТекСтрокаКартриджи.Исполнено;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПроверкаИсполненияДокумента();
	
КонецПроцедуры

//Процедура проверяет количество отгруженных и количество требуемых картриджей и ставит статус исполнения документа.
Процедура ПроверкаИсполненияДокумента()
	
	НеВыполнено = 0;
	ВыполненоЧастично = 0;
	Выполнено = 0;	
	КоличествоСтрокКартриджей = Картриджи.Количество();
	
	Для Каждого Строка Из Картриджи Цикл
		
		Если Строка.Исполнено = 0 Тогда			
			НеВыполнено = НеВыполнено + 1;						
		ИначеЕсли Строка.Исполнено < Строка.Количество Тогда
			ВыполненоЧастично = ВыполненоЧастично + 1;			
		ИначеЕсли Строка.Исполнено = Строка.Количество Или Строка.Исполнено > Строка.Количество Тогда
			Выполнено = Выполнено + 1;			
		КонецЕсли;
				
	КонецЦикла;
	
	Если ВыполненоЧастично > 0 Тогда
		Исполнен = Перечисления.ИсполнениеСпросов.ВыполненоЧастично;
	ИначеЕсли НеВыполнено = КоличествоСтрокКартриджей Тогда
		Исполнен = Перечисления.ИсполнениеСпросов.НеВыполнено;
	ИначеЕсли Выполнено = КоличествоСтрокКартриджей Тогда
		Исполнен = Перечисления.ИсполнениеСпросов.Выполнено;
	КонецЕсли;
		
КонецПроцедуры
